<a href="https://colab.research.google.com/github/praveenkumar21122006/Crypto-Portfolio-Manager/blob/main/praveen_sql.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [2]:
import sqlite3

In [3]:
conn = sqlite3.connect("test.db")
print("Database connected successfully!")

Database connected successfully!

In [4]:
cursor = conn.cursor()

Data Definition Language (DDL) Command

In [5]:
cursor.execute("DROP TABLE IF EXISTS students")

> 1. CREATE

In [6]:
cursor.execute("""
CREATE TABLE IF NOT EXISTS students (
    id INTEGER PRIMARY KEY,
    name TEXT,
    age INTEGER
)
""")
print("Table created!")

# Verify schema and data
cursor.execute("PRAGMA table_info(students)")
schema = cursor.fetchall()
print("Schema:", schema)

Table created!
Schema: [(0, 'id', 'INTEGER', 0, None, 1), (1, 'name', 'TEXT', 0, None, 0), (2, 'age', 'INTEGER', 0, None, 0)]

> 2. ALTER

In [7]:
cursor.execute("ALTER TABLE students ADD COLUMN grade TEXT ")
print("Column added!")

# Verify schema and data
cursor.execute("PRAGMA table_info(students)")
schema = cursor.fetchall()
print("Schema:", schema)

Column added!
Schema: [(0, 'id', 'INTEGER', 0, None, 1), (1, 'name', 'TEXT', 0, None, 0), (2, 'age', 'INTEGER', 0, None, 0), (3, 'grade', 'TEXT', 0, None, 0)]

> 3. DROP

In [8]:
cursor.execute("DROP TABLE IF EXISTS students")
print("Table dropped!")

# Verify schema and data
cursor.execute("PRAGMA table_info(students)")
schema = cursor.fetchall()
print("Schema:", schema)

Table dropped!
Schema: []

Data Manipulation Language (DML) Commands

In [ ]:
cursor.execute("DROP TABLE IF EXISTS employees")

In [9]:
cursor.execute("""
CREATE TABLE IF NOT EXISTS employees (
    id INTEGER PRIMARY KEY,
    name TEXT,
    dept TEXT,
    salary REAL
)
""")
print("Table created!")

Table created!

> 1. INSERT

In [10]:
cursor.execute("INSERT INTO employees (name, dept, salary) VALUES ('praveen', 'CS', 50000)")
cursor.execute("INSERT INTO employees (name, dept, salary) VALUES ('Rahul', 'IT', 60000), ('mohan', 'CS', 55000), ('vishnu', 'IT', 65000), ('nisanth', 'MECH', 45000), ('Anaya', 'CS', 70000)")

conn.commit()

print("Data inserted!")

Data inserted!

> 2. SELECT

In [11]:
cursor.execute("SELECT * FROM employees")

rows = cursor.fetchall()

for row in rows:
    print(row)

(1, 'praveen', 'CS', 50000.0)
(2, 'Rahul', 'IT', 60000.0)
(3, 'mohan', 'CS', 55000.0)
(4, 'vishnu', 'IT', 65000.0)
(5, 'nisanth', 'MECH', 45000.0)
(6, 'Anaya', 'CS', 70000.0)

> 3. UPDATE

In [12]:
cursor.execute("UPDATE employees SET salary = 40000 WHERE name = 'Rohan'")
conn.commit()

# Verify update
cursor.execute("SELECT * FROM employees")
rows = cursor.fetchall()
for row in rows:
    print(row)

(1, 'praveen', 'CS', 50000.0)
(2, 'Rahul', 'IT', 60000.0)
(3, 'mohan', 'CS', 55000.0)
(4, 'vishnu', 'IT', 65000.0)
(5, 'nisanth', 'MECH', 45000.0)
(6, 'Anaya', 'CS', 70000.0)

> 4. DELETE

In [13]:
cursor.execute("DELETE FROM employees WHERE name = 'Rohan'")
conn.commit()

print(f"Rows deleted: {cursor.rowcount}")

# Verify deletion
cursor.execute("SELECT * FROM employees")
rows = cursor.fetchall()
for row in rows:
    print(row)

Rows deleted: 0
(1, 'praveen', 'CS', 50000.0)
(2, 'Rahul', 'IT', 60000.0)
(3, 'mohan', 'CS', 55000.0)
(4, 'vishnu', 'IT', 65000.0)
(5, 'nisanth', 'MECH', 45000.0)
(6, 'Anaya', 'CS', 70000.0)

Data Control Language (DCL) Commands

In [14]:
cursor.execute("DROP TABLE IF EXISTS users")
cursor.execute("""
CREATE TABLE IF NOT EXISTS users (
    id INTEGER PRIMARY KEY,
    username TEXT UNIQUE,
    role TEXT
)
""")
print("Users table created!")

# Insert some sample users
cursor.execute("INSERT INTO users (username, role) VALUES ('admin', 'administrator'), ('user1', 'employee'), ('user2', 'manager')")
conn.commit()

print("Sample users inserted!")

cursor.execute("SELECT * FROM users")
rows = cursor.fetchall()
for row in rows:
    print(row)

Users table created!
Sample users inserted!
(1, 'admin', 'administrator')
(2, 'user1', 'employee')
(3, 'user2', 'manager')

Querying Data Commands

In [15]:
cursor.execute("DROP TABLE IF EXISTS orders")

cursor.execute("""
CREATE TABLE IF NOT EXISTS orders (
    id INTEGER PRIMARY KEY,
    customer_id INTEGER,
    product_name TEXT,
    quantity INTEGER,
    price REAL,
    order_date TEXT
)
""")
print("Orders table created!")

# Insert sample data
cursor.executemany("INSERT INTO orders (customer_id, product_name, quantity, price, order_date) VALUES (?, ?, ?, ?, ?)", [
    (1, 'Laptop', 1, 1200.00, '2023-01-15'),
    (2, 'Mouse', 2, 25.00, '2023-02-20'),
    (1, 'Keyboard', 1, 75.00, '2023-03-10'),
    (3, 'Monitor', 1, 300.00, '2023-04-05'),
    (2, 'Headphones', 3, 150.00, '2023-05-12'),
    (1, 'Laptop', 1, 1200.00, '2023-06-18')
])
conn.commit()
print("Sample data inserted!")

# Verify
cursor.execute("SELECT * FROM orders")
rows = cursor.fetchall()
for row in rows:
    print(row)

Orders table created!
Sample data inserted!
(1, 1, 'Laptop', 1, 1200.0, '2023-01-15')
(2, 2, 'Mouse', 2, 25.0, '2023-02-20')
(3, 1, 'Keyboard', 1, 75.0, '2023-03-10')
(4, 3, 'Monitor', 1, 300.0, '2023-04-05')
(5, 2, 'Headphones', 3, 150.0, '2023-05-12')
(6, 1, 'Laptop', 1, 1200.0, '2023-06-18')

> 1. SELECT Statement

In [16]:
cursor.execute("SELECT product_name, price FROM orders")
rows = cursor.fetchall()
for row in rows:
    print(row)

('Laptop', 1200.0)
('Mouse', 25.0)
('Keyboard', 75.0)
('Monitor', 300.0)
('Headphones', 150.0)
('Laptop', 1200.0)

> 2. WHERE Clause

In [17]:
cursor.execute("SELECT product_name, quantity, price FROM orders WHERE quantity > 1")
rows = cursor.fetchall()
for row in rows:
    print(row)

('Mouse', 2, 25.0)
('Headphones', 3, 150.0)

> 3. ORDER BY Clause

In [18]:
cursor.execute("SELECT product_name, SUM(quantity) AS total_quantity FROM orders GROUP BY product_name ORDER BY total_quantity DESC")
rows = cursor.fetchall()
for row in rows:
    print(row)

('Headphones', 3)
('Mouse', 2)
('Laptop', 2)
('Monitor', 1)
('Keyboard', 1)

> 4. GROUP BY Clause

In [19]:
cursor.execute("SELECT product_name, SUM(quantity) AS total_quantity FROM orders GROUP BY product_name")
rows = cursor.fetchall()
for row in rows:
    print(row)

('Headphones', 3)
('Keyboard', 1)
('Laptop', 2)
('Monitor', 1)
('Mouse', 2)

> 5. HAVING Clause

In [20]:
cursor.execute("SELECT product_name, SUM(quantity) AS total_quantity FROM orders GROUP BY product_name HAVING SUM(quantity) > 1")
rows = cursor.fetchall()
for row in rows:
    print(row)

('Headphones', 3)
('Laptop', 2)
('Mouse', 2)

Joining Commands

In [21]:
cursor.execute("DROP TABLE IF EXISTS table_a")
cursor.execute("DROP TABLE IF EXISTS table_b")

cursor.execute("""
CREATE TABLE table_a (
    id INTEGER,
    name TEXT
)
""")

cursor.execute("""
CREATE TABLE table_b (
    id INTEGER,
    name TEXT
)
""")

# Insert data into table_a
cursor.executemany("INSERT INTO table_a (id, name) VALUES (?, ?)", [
    (1, 'Alice'),
    (2, 'Bob'),
    (3, 'Charlie')
])

# Insert data into table_b
cursor.executemany("INSERT INTO table_b (id, name) VALUES (?, ?)", [
    (1, 'Alice'),
    (2, 'Bob'),
    (4, 'David')
])

conn.commit()

print("Tables created and data inserted!")

# Verify table_a
cursor.execute("SELECT * FROM table_a")
rows_a = cursor.fetchall()
print("Table A:", rows_a)
print("-"*20)

# Verify table_b
cursor.execute("SELECT * FROM table_b")
rows_b = cursor.fetchall()
print("Table B:", rows_b)

Tables created and data inserted!
Table A: [(1, 'Alice'), (2, 'Bob'), (3, 'Charlie')]
--------------------
Table B: [(1, 'Alice'), (2, 'Bob'), (4, 'David')]

> 1. INNER JOIN

In [22]:
cursor.execute("""
SELECT *
FROM table_a a INNER JOIN table_b b
ON a.id = b.id
""")

rows = cursor.fetchall()
for row in rows:
    print(row)

(1, 'Alice', 1, 'Alice')
(2, 'Bob', 2, 'Bob')

> 2. LEFT JOIN

In [23]:
cursor.execute("""
SELECT *
FROM table_a a LEFT JOIN table_b b
ON a.id = b.id
""")

rows = cursor.fetchall()
for row in rows:
    print(row)

(1, 'Alice', 1, 'Alice')
(2, 'Bob', 2, 'Bob')
(3, 'Charlie', None, None)

> 3. RIGHT JOIN

In [25]:
cursor.execute("""
SELECT *
FROM table_b b
LEFT JOIN table_a a
ON a.id = b.id
""")

rows = cursor.fetchall()
for row in rows:
    print(row)

(1, 'Alice', 1, 'Alice')
(2, 'Bob', 2, 'Bob')
(4, 'David', None, None)

> 4. FULL JOIN

In [27]:
cursor.execute("""
SELECT *
FROM table_a a
LEFT JOIN table_b b ON a.id = b.id

UNION

SELECT *
FROM table_b b
LEFT JOIN table_a a ON a.id = b.id
""")

rows = cursor.fetchall()
for row in rows:
    print(row)

(1, 'Alice', 1, 'Alice')
(2, 'Bob', 2, 'Bob')
(3, 'Charlie', None, None)
(4, 'David', None, None)

> 5. CROSS JOIN

In [28]:
cursor.execute("SELECT * FROM table_a a CROSS JOIN table_b b")

rows = cursor.fetchall()
for row in rows:
    print(row)

(1, 'Alice', 1, 'Alice')
(1, 'Alice', 2, 'Bob')
(1, 'Alice', 4, 'David')
(2, 'Bob', 1, 'Alice')
(2, 'Bob', 2, 'Bob')
(2, 'Bob', 4, 'David')
(3, 'Charlie', 1, 'Alice')
(3, 'Charlie', 2, 'Bob')
(3, 'Charlie', 4, 'David')

> 6. SELF JOIN

In [29]:
cursor.execute("""
SELECT *
FROM table_a a
JOIN table_a b ON a.id = b.id
""")

rows = cursor.fetchall()
for row in rows:
    print(row)

(1, 'Alice', 1, 'Alice')
(2, 'Bob', 2, 'Bob')
(3, 'Charlie', 3, 'Charlie')

> 7. NATURAL JOIN

In [30]:
cursor.execute("SELECT * FROM table_a a NATURAL JOIN table_b b")

rows = cursor.fetchall()
for row in rows:
    print(row)

(1, 'Alice')
(2, 'Bob')

SUBQUERIES IN SQL

In [31]:
cursor.execute("DROP TABLE IF EXISTS employees_hierarchy")

cursor.execute("""
CREATE TABLE employees_hierarchy (
    id INTEGER PRIMARY KEY,
    name TEXT,
    manager_id INTEGER,
    salary REAL
)
""")

# Insert sample data
cursor.executemany("INSERT INTO employees_hierarchy (name, manager_id, salary) VALUES (?, ?, ?)", [
    ('Alice', None, 80000),  # Top manager
    ('Bob', 1, 60000),
    ('Charlie', 1, 55000),
    ('David', 2, 50000),
    ('Eve', 2, 45000)
])

conn.commit()

print("Table created and data inserted!")

# Verify
cursor.execute("SELECT * FROM employees_hierarchy")
rows = cursor.fetchall()
for row in rows:
    print(row)

Table created and data inserted!
(1, 'Alice', None, 80000.0)
(2, 'Bob', 1, 60000.0)
(3, 'Charlie', 1, 55000.0)
(4, 'David', 2, 50000.0)
(5, 'Eve', 2, 45000.0)

> 1. IN Command

In [32]:
cursor.execute("""
SELECT name, salary
FROM employees_hierarchy
WHERE id IN (
    SELECT manager_id
    FROM employees_hierarchy
    WHERE salary > 50000
)
""")

rows = cursor.fetchall()
for row in rows:
    print(row)

('Alice', 80000.0)

Aggregate Functions Commands

In [33]:
cursor.execute("DROP TABLE IF EXISTS sales")

cursor.execute("""
CREATE TABLE IF NOT EXISTS sales (
    id INTEGER PRIMARY KEY,
    product_name TEXT,
    category TEXT,
    quantity INTEGER,
    price REAL,
    total REAL
)
""")

# Insert sample data
cursor.executemany("INSERT INTO sales (product_name, category, quantity, price, total) VALUES (?, ?, ?, ?, ?)", [
    ('Laptop', 'Electronics', 5, 1000.00, 5000.00),
    ('Mouse', 'Electronics', 10, 20.00, 200.00),
    ('Book', 'Education', 20, 15.00, 300.00),
    ('Chair', 'Furniture', 3, 150.00, 450.00),
    ('Pen', 'Stationery', 50, 2.00, 100.00),
    ('Tablet', 'Electronics', 2, 500.00, 1000.00)
])

conn.commit()

print("Sales table created and data inserted!")

# Verify
cursor.execute("SELECT * FROM sales")
rows = cursor.fetchall()
for row in rows:
    print(row)

Sales table created and data inserted!
(1, 'Laptop', 'Electronics', 5, 1000.0, 5000.0)
(2, 'Mouse', 'Electronics', 10, 20.0, 200.0)
(3, 'Book', 'Education', 20, 15.0, 300.0)
(4, 'Chair', 'Furniture', 3, 150.0, 450.0)
(5, 'Pen', 'Stationery', 50, 2.0, 100.0)
(6, 'Tablet', 'Electronics', 2, 500.0, 1000.0)

> 1. COUNT()

In [34]:
cursor.execute("SELECT COUNT(*) AS total_rows FROM sales")

rows = cursor.fetchall()
for row in rows:
    print(f"Total rows: {row[0]}")

Total rows: 6

> 2. SUM()

In [35]:
cursor.execute("SELECT SUM(total) AS total_sales_price FROM sales")

rows = cursor.fetchall()
for row in rows:
    print(f"Total sales price: {row[0]}")

Total sales price: 7050.0

> 3. AVG()

In [36]:
cursor.execute("SELECT AVG(price) AS average_price FROM sales")

rows = cursor.fetchall()
for row in rows:
    print(f"Average price: {row[0]}")

Average price: 281.1666666666667

In [37]:
cursor.execute("SELECT AVG(price) AS average_price FROM sales WHERE category = 'Electronics'")

rows = cursor.fetchall()
for row in rows:
    print(f"Average price of Electronics: {row[0]}")

Average price of Electronics: 506.6666666666667

> 4. MIN()

In [38]:
cursor.execute("SELECT MIN(price) AS min_price FROM sales")

rows = cursor.fetchall()
for row in rows:
    print(f"Minimum price: {row[0]}")

Minimum price: 2.0

> 5. MAX()

In [39]:
cursor.execute("SELECT MAX(price) AS max_price FROM sales")

rows = cursor.fetchall()
for row in rows:
    print(f"Maximum price: {row[0]}")

Maximum price: 1000.0

String Functions in SQL

In [40]:
cursor.execute("DROP TABLE IF EXISTS string_examples")

cursor.execute("""
CREATE TABLE IF NOT EXISTS string_examples (
    id INTEGER PRIMARY KEY,
    name TEXT,
    description TEXT,
    code TEXT
)
""")

# Insert sample data
cursor.executemany("INSERT INTO string_examples (name, description, code) VALUES (?, ?, ?)", [
    ('Python', 'A programming language', 'PY'),
    ('JavaScript', 'A scripting language', 'JS'),
    ('SQL', 'A query language', 'SQL'),
    ('HTML', 'A markup language', 'HTML')
])

conn.commit()

print("String examples table created and data inserted!")

# Verify
cursor.execute("SELECT * FROM string_examples")
rows = cursor.fetchall()
for row in rows:
    print(row)

String examples table created and data inserted!
(1, 'Python', 'A programming language', 'PY')
(2, 'JavaScript', 'A scripting language', 'JS')
(3, 'SQL', 'A query language', 'SQL')
(4, 'HTML', 'A markup language', 'HTML')

> 1. CONCAT()

In [42]:
cursor.execute("""
SELECT name || ' - ' || code AS combined
FROM string_examples
""")

rows = cursor.fetchall()
for row in rows:
    print(f"Combined string: {row[0]}")

Combined string: Python - PY
Combined string: JavaScript - JS
Combined string: SQL - SQL
Combined string: HTML - HTML

> 2. SUBSTRING()/SUBSTR()

In [43]:
cursor.execute("SELECT SUBSTRING(description, 3, 5) AS substring_desc FROM string_examples")

rows = cursor.fetchall()
for row in rows:
    print(f"Substring of description: {row[0]}")

Substring of description: progr
Substring of description: scrip
Substring of description: query
Substring of description: marku

> 3. CHAR_LENGTH()/LENGTH()

In [44]:
cursor.execute("SELECT description, LENGTH(description) AS desc_length FROM string_examples")

rows = cursor.fetchall()
for row in rows:
    print(f"Description: {row[0]}, Length: {row[1]}")

Description: A programming language, Length: 22
Description: A scripting language, Length: 20
Description: A query language, Length: 16
Description: A markup language, Length: 17

> 4. UPPER()

In [45]:
cursor.execute("SELECT UPPER(NAME) AS upper_name FROM string_examples")

rows = cursor.fetchall()
for row in rows:
    print(f"Uppercase name: {row[0]}")

Uppercase name: PYTHON
Uppercase name: JAVASCRIPT
Uppercase name: SQL
Uppercase name: HTML

> 5. LOWER()

In [46]:
cursor.execute("SELECT LOWER(NAME) AS lower_name FROM string_examples")

rows = cursor.fetchall()
for row in rows:
    print(f"Lowercase name: {row[0]}")

Lowercase name: python
Lowercase name: javascript
Lowercase name: sql
Lowercase name: html

> 6. TRIM()

In [47]:
cursor.execute("SELECT TRIM('  Hello World  ') AS trimmed_string")

rows = cursor.fetchall()
for row in rows:
    print(f"Trimmed string: '{row[0]}'")

Trimmed string: 'Hello World'

Date and Time SQL Commands

> 1. CURRENT_DATE()

In [48]:
cursor.execute("SELECT DATE('now')")

rows = cursor.fetchall()
for row in rows:
    print(f"Current date: {row[0]}")

Current date: 2026-02-20

> 2. CURRENT_TIME()

In [49]:
cursor.execute("SELECT TIME('now')")

rows = cursor.fetchall()
for row in rows:
    print(f"Current time: {row[0]}")

Current time: 15:14:42

> 3. CURRENT_TIMESTAMP()

In [50]:
cursor.execute("SELECT DATETIME('now')")

rows = cursor.fetchall()
for row in rows:
    print(f"Current datetime: {row[0]}")

Current datetime: 2026-02-20 15:14:46

> 4. DATE_PART()

In [51]:
cursor.execute("SELECT strftime('%Y', 'now')")

rows = cursor.fetchall()
for row in rows:
    print(f"Current year: {row[0]}")

Current year: 2026

> 5. DATE_ADD()/DATE_SUB()

In [52]:
cursor.execute("""
SELECT
    date('now', '+7 days'),
    date('now', '-3 days'),
    date('now', '+1 month'),
    datetime('now', '+2 hours')
""")

row = cursor.fetchone()

print("After 7 days:", row[0])
print("3 days ago:", row[1])
print("After 1 month:", row[2])
print("After 2 hours:", row[3])

After 7 days: 2026-02-27
3 days ago: 2026-02-17
After 1 month: 2026-03-20
After 2 hours: 2026-02-20 17:14:52

> 6. EXTRACT()

In [53]:
cursor.execute("SELECT strftime('%Y', 'now')")
print("Year:", cursor.fetchone()[0])

cursor.execute("SELECT strftime('%m', 'now')")
print("Month:", cursor.fetchone()[0])

Year: 2026
Month: 02

> 7. TO_CHAR()

In [54]:
cursor.execute("SELECT strftime('%d/%m/%Y', 'now')")
print(cursor.fetchone()[0])

20/02/2026

Conditional Expressions

In [55]:
cursor.execute("DROP TABLE IF EXISTS conditional_test")

cursor.execute("""
CREATE TABLE IF NOT EXISTS conditional_test (
    id INTEGER PRIMARY KEY,
    name TEXT,
    age INTEGER,
    salary REAL,
    department TEXT,
    status TEXT
)
""")

# Insert sample data
cursor.executemany("INSERT INTO conditional_test (name, age, salary, department, status) VALUES (?, ?, ?, ?, ?)", [
    ('Alice', 28, 50000, 'IT', 'Active'),
    ('Bob', 35, 60000, 'HR', 'Active'),
    ('Charlie', 42, 75000, 'IT', 'Inactive'),
    ('David', 25, 40000, 'Finance', 'Active'),
    ('Eve', 38, 70000, 'HR', 'Active'),
    ('Frank', 31, 55000, 'IT', 'Inactive')
])

conn.commit()

print("Conditional test table created and data inserted!")

# Verify
cursor.execute("SELECT * FROM conditional_test")
rows = cursor.fetchall()
for row in rows:
    print(row)

Conditional test table created and data inserted!
(1, 'Alice', 28, 50000.0, 'IT', 'Active')
(2, 'Bob', 35, 60000.0, 'HR', 'Active')
(3, 'Charlie', 42, 75000.0, 'IT', 'Inactive')
(4, 'David', 25, 40000.0, 'Finance', 'Active')
(5, 'Eve', 38, 70000.0, 'HR', 'Active')
(6, 'Frank', 31, 55000.0, 'IT', 'Inactive')

> 1. CASE Statement

In [56]:
cursor.execute("""
SELECT name, salary,
CASE
    WHEN salary < 50000 THEN 'Low'
    WHEN salary BETWEEN 50000 AND 70000 THEN 'Medium'
    ELSE 'High'
END AS salary_category
FROM conditional_test
""")

rows = cursor.fetchall()
for row in rows:
    print(row)

('Alice', 50000.0, 'Medium')
('Bob', 60000.0, 'Medium')
('Charlie', 75000.0, 'High')
('David', 40000.0, 'Low')
('Eve', 70000.0, 'Medium')
('Frank', 55000.0, 'Medium')

> 2. IF() Function

In [57]:
cursor.execute("SELECT name, salary, IIF(salary > 50000, 'High Salary', 'Low Salary') AS salary_status FROM conditional_test")

rows = cursor.fetchall()
for row in rows:
    print(row)

('Alice', 50000.0, 'Low Salary')
('Bob', 60000.0, 'High Salary')
('Charlie', 75000.0, 'High Salary')
('David', 40000.0, 'Low Salary')
('Eve', 70000.0, 'High Salary')
('Frank', 55000.0, 'High Salary')

> 3. COALESCE() Function

In [58]:
cursor.execute("SELECT name, COALESCE(salary, 0) AS adjusted_salary FROM conditional_test")

rows = cursor.fetchall()
for row in rows:
    print(row)

('Alice', 50000.0)
('Bob', 60000.0)
('Charlie', 75000.0)
('David', 40000.0)
('Eve', 70000.0)
('Frank', 55000.0)

> 4. FULLIF() Function

In [59]:
cursor.execute("SELECT name, salary, NULLIF(salary, 0) AS non_zero_salary FROM conditional_test")
rows = cursor.fetchall()
for row in rows:
    print(row)

('Alice', 50000.0, 50000.0)
('Bob', 60000.0, 60000.0)
('Charlie', 75000.0, 75000.0)
('David', 40000.0, 40000.0)
('Eve', 70000.0, 70000.0)
('Frank', 55000.0, 55000.0)

SET OPERATIONS

In [60]:
cursor.executescript("""
CREATE TABLE class_a (id INTEGER, name TEXT);
CREATE TABLE class_b (id INTEGER, name TEXT);

INSERT INTO class_a VALUES (1,'Amit'),(2,'Neha'),(3,'Rahul');
INSERT INTO class_b VALUES (3,'Rahul'),(4,'Priya'),(5,'Karan');
""")

cursor.execute("""
SELECT * FROM class_a
UNION
SELECT * FROM class_b
""")

for row in cursor.fetchall():
    print(row)

(1, 'Amit')
(2, 'Neha')
(3, 'Rahul')
(4, 'Priya')
(5, 'Karan')

> 1. UNION

In [61]:
cursor.execute("""
SELECT * FROM class_a
UNION
SELECT * FROM class_b
""")

print("UNION result:")
for row in cursor.fetchall():
    print(row)

UNION result:
(1, 'Amit')
(2, 'Neha')
(3, 'Rahul')
(4, 'Priya')
(5, 'Karan')

> 2. UNION ALL

In [62]:
cursor.execute("""
SELECT * FROM class_a
UNION ALL
SELECT * FROM class_b
""")

print("\nUNION ALL result:")
for row in cursor.fetchall():
    print(row)

UNION ALL result:
(1, 'Amit')
(2, 'Neha')
(3, 'Rahul')
(3, 'Rahul')
(4, 'Priya')
(5, 'Karan')

> 3. INTERSECTION

In [63]:
cursor.execute("""
SELECT * FROM class_a
INTERSECT
SELECT * FROM class_b
""")

print("\nINTERSECT result:")
for row in cursor.fetchall():
    print(row)

INTERSECT result:
(3, 'Rahul')

> 4. EXCEPT

In [64]:
cursor.execute("""
SELECT * FROM class_a
EXCEPT
SELECT * FROM class_b
""")

print("\nEXCEPT result:")
for row in cursor.fetchall():
    print(row)

EXCEPT result:
(1, 'Amit')
(2, 'Neha')

In [65]:
conn.commit()   # save changes (if needed)
conn.close()    # close connection
print("Database connection closed.")

Database connection closed.